In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [6]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [7]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [8]:
df['col2'].nunique()

3

In [9]:
def times2(x):
    return x*2

In [10]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [11]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [14]:
def divide2(y):
    return y/2

In [15]:
df['col2'].apply(divide2)

0    222.0
1    277.5
2    333.0
3    222.0
Name: col2, dtype: float64

In [16]:
df['col2'].sum()

2109

In [17]:
readdf=pd.read_csv('example')

In [18]:
readdf

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
readdf2=pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [20]:
readdf2

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [21]:
readdf3=pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [32]:
readdf3[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
...,...,...,...,...,...,...,...
554,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
555,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
556,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
557,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
558,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [24]:
readdf3[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"

In [34]:
readdf4=readdf3[0]

In [35]:
readdf4

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
...,...,...,...,...,...,...,...
554,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
555,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
556,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
557,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
558,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [38]:
readdf4['City'].unique()

array(['Newark', 'Maumee', 'Louisa', 'Cooper', 'Chicago', 'Argonia',
       'Saint Elmo', 'Milwaukee', 'New Orleans', 'Cottonwood Heights',
       'Pennsville', 'Mulberry', 'Woodbury', 'King of Prussia', 'Memphis',
       'Longview', 'Peachtree City', 'Denver', 'San Juan', 'Atlanta',
       'Crestview', 'Mankato', 'Palm Desert', 'Rising Sun', 'Conyers',
       'Freedom', 'Fort Lauderdale', 'Moline', 'Bel Air', 'Cincinnati',
       'Berwyn', 'Fairfax', 'Horsham', 'Sterling', 'Boise', 'El Reno',
       'West Chicago', 'The Woodlands', 'Graceville', 'Edinburg',
       'Bridgeport', 'Phoenix', 'Parsons', 'Wausau', 'Fort Myers',
       'Sevierville', 'North Las Vegas', 'Kenosha', 'Scottsdale',
       'Valdosta', 'Asheville', 'Douglasville', 'Lenoir', 'Marianna',
       'Orange Park', 'Lexington', 'Gold Canyon', 'LaGrange', 'Andover',
       'University Place', 'Sunrise Beach', 'Braselton', 'Princeton',
       'Lutz', 'Sedalia', 'Tamarac', 'Destin', 'Crete', 'St. Louis',
       'Bloomington', 'Waukegan', 'Jasper', 'Leawood', 'Woodstock',
       'Buford', 'Naples', 'Glasgow', 'Ailey', 'Lynchburg', 'Marietta',
       'Palatka', 'Whiteville', 'Shabbona', 'Charleston', 'Kingfisher',
       'Sylacauga', 'North Lauderdale', 'Pawleys Island', 'Maple Grove',
       'Gaithersburg', 'Cambridge', 'Fort Lee', 'Dearborn', 'Wilmette',
       'Rock Spring', 'Doraville', 'Little Falls', 'Ellaville',
       'Shelbyville', 'Hoffman Estates', 'Knoxville', 'Forest Lake',
       'Franklin', 'Jacksonville', 'Boothwyn', 'Stockbridge', 'Belleview',
       'Lacombe', 'Johnston', 'Rockmart', 'Saint George', 'Omaha',
       'Des Plaines', 'Greenwood Village', 'Jonesboro', 'Decatur',
       'Clearwater', 'Aledo', 'Cranford', 'Gray', 'Ellington', 'Wyoming',
       'Plano', 'Nevada City', 'Norfolk', 'Milton', 'Cumming', 'Geneva',
       'Statesboro', 'Palm Beach', 'Huntingdon Valley', 'Olathe',
       'Colfax', 'Shorewood', 'Evansville', 'Columbia', 'Richmond',
       'Greeley', 'Sarasota', 'Apollo Beach', 'Prescott',
       'Port St. Lucie', 'Windsor', 'Castle Rock', 'Clayton', 'Tampa',
       'Jackson', 'Snohomish', 'Burlington', 'Macon', 'Cocoa Beach',
       'Mount Clemens', 'Dallas', 'Brooksville', 'Winter Park',
       'Carthage', 'Rosemount', 'Birmingham', 'East Ellijay',
       'Cartersville', 'Las Vegas', 'Western Springs', 'Wood Dale',
       'Davis', 'St. Charles', 'San Luis Obispo', 'Napa', 'Springfield',
       'Clarkesville', 'Palm Springs', 'Cassville', 'Hamtramck',
       'Port Orange', 'Watkinsville', 'Roswell', 'Taos', 'Louisville',
       'Stoughton', 'Camargo', 'Easley', 'McDonough', 'Brunswick',
       'Orlando', 'Lino Lakes', 'Batesville', 'McCaysville',
       'Dawsonville', 'Coral Gables', 'Southampton', 'Farmington Hills',
       'Bala Cynwyd', 'Carrabelle', 'Vidalia', 'Tifton', 'Westminster',
       'Tacoma', 'Woodland Hills', 'Randallstown', 'Overland Park',
       'Maywood', 'Barnesville', 'Gordon', 'Jefferson City',
       'Chesterfield', 'Shoreline', 'Crawfordville', 'Arlington',
       'Ponte Vedra Beach', 'West Allis', 'Milford', 'Winder', 'Ellijay',
       'Cherry Hill', 'Bradenton', 'Sonoma', 'Solvang', 'Chico',
       'Stockton', 'Martinsville', 'Ocala', 'Bartow', 'Palos Heights',
       'Eugene', 'Panama City Beach', 'Port Saint Joe', 'Acworth',
       'Cave Junction', 'New Prague', 'Sylvan Grove', 'Kingstree',
       'Lantana', 'Hastings', 'Clewiston', 'Aventura', 'Miami',
       'Spartanburg', 'Bluffton', 'Blackwell', 'Port Chester',
       'Baltimore', 'Albuquerque', 'Savannah', 'Englewood', 'Reno',
       'Seattle', 'Lincoln', 'Arcola', 'Rosedale', 'Granite Bay',
       'Saint Paul', 'Elmwood Park', 'Plymouth', 'Saint Marys',
       'San Diego', 'Mesa', 'Champlin', 'Bonifay', 'Everett', 'Butler',
       'Creve Coeur', 'Port Huron', 'Mayaguez', 'Hato Rey', 'Naperville',
       'Peotone', 'Rockford', 'Lynnwood', 'San Rafael', 'Oakland',
       'Lowell', 'Fort Pierce', 'Clermont', 'Sterling Heights',
       'Myrtle Beach', 'Key West', 'Carrollton', 'Aurora', 'Fort Deposit',
       'Hiawassee', 'Draper', 'Duluth', 'Parma', 'Covington', 'New York',
       'Ogden', 'Germantown', 'Normal', 'Boca Raton', 'Carson City',
       'La Jolla', 'Orland Park', 'La Coste', 'Marco Island', 'Hancock',
       'Bainbridge Island', 'Los Angeles', 'Cornelia', 'Hallock',
       'Immokalee', 'The Dalles', 'Santa Fe', 'Leeton', 'Kaysville',
       'St. Stephen', 'Antioch', 'Bellingham', 'Santa Monica', 'Irondale',
       'New Baltimore', 'Panama City', 'Reston', 'Cleveland',
       'Reidsville', 'Norcross', 'San Clemente', 'San Francisco',
       'Oakdale', 'Detroit', 'Sparta', 'Houston', 'Madisonville',
       'Teague', 'Lemont', 'Westmont', 'Otsego', 'Racine',
       'Lawrenceville', 'Bakersfield', 'Pueblo', 'Spring Grove', 'Warren',
       'Columbus', 'Lacey', 'Flagstaff', 'Rolling Meadows', 'Sioux City',
       'Oak Forest', 'Kansas City', 'Ventura', 'Austin', 'Newnan',
       'Gilbert', 'Montgomery', 'Pittsburgh', 'Prineville', 'Venice',
       'Harvey', 'Elizabeth', 'West Chester', 'Jupiter', 'Altus', 'Perry',
       'Alpharetta', 'Suwanee', 'Williamsville', 'Temecula',
       'Rancho Cucamonga', 'Sioux Falls', 'Thermopolis', 'Worth',
       'Danville', 'Oregon', 'Winchester', 'Clinton', 'Irvine',
       'Pine City', 'Villa Rica', 'Anthony', 'Wilmington', 'Fayetteville',
       'Lincolnwood', 'Macomb', 'Champaign', 'Bremerton', 'Layton',
       'Ridgewood', 'Ketchum', 'Calabasas', 'Kennesaw', 'Elko',
       'Sugar Creek', 'Paola', 'Colorado Springs', 'Commerce',
       'Henderson', 'Glenwood', 'Silverton', 'Beaverton', 'Pittsfield',
       'Cape Coral', 'Loup City', 'Merced', 'Culver City', 'Crofton',
       'Salt Lake City', 'Redlands', 'Vancouver', 'Berkeley', 'Sanderson',
       'Pomona', 'Newport Beach', 'Loganville', 'Eldred', 'Northville',
       'Northfork', 'Topeka', 'Pasadena', 'Staples', 'Bentonville',
       'Hume', 'Lakeview', 'Ephraim', 'White Plains', 'Tallahassee',
       'Philadelphia', 'Blanchardville', 'Torrance', 'Cheneyville',
       'Alamo', 'Stamford', 'Shelby Township', 'Oakwood', 'Sierra Blanca',
       'Gravette', 'Hinsdale', 'Malta', 'Manchester', 'Metropolis',
       'Honolulu'], dtype=object)

In [39]:
readdf4['City'].nunique()

429

In [40]:
readdf4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 7 columns):
Bank Name                559 non-null object
City                     559 non-null object
ST                       559 non-null object
CERT                     559 non-null int64
Acquiring Institution    559 non-null object
Closing Date             559 non-null object
Updated Date             559 non-null object
dtypes: int64(1), object(6)
memory usage: 30.7+ KB